***Project 2 - Part 3B: Transform & Load***
-

I) Normalizing Genres
-

In [1]:
## Standard Imports
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import os, json
from sqlalchemy.engine import create_engine
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus

In [2]:
df = pd.read_csv("DATA/basics.csv")
df.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama

In [3]:
df['genres'].head()

0    Comedy,Fantasy,Romance
1                     Drama
2                     Drama
3      Comedy,Horror,Sci-Fi
4                     Drama
Name: genres, dtype: object

1. Getting a List of Unique Genres

In [4]:
## create a col with a list of genres
df['genres_split'] = df['genres'].str.split(',')
df.head(2)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama,[Drama]

In [5]:
exploded_genres = df.explode('genres_split')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama,Drama
...,...,...,...,...,...,...,...,...,...,...
86977,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller",Action
86977,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller",Adventure
86977,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller",Thriller
86978,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History",Drama
86978,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History",History

In [6]:
unique_genres = sorted(exploded_genres['genres_split'].unique())

In [7]:
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

2. Create a new title_genres table

In [8]:
title_genres = exploded_genres[['tconst','genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

3. Create a genre mapper dictionary to replace string genres with integers

In [9]:
## Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
map = dict(zip(unique_genres, genre_ints))
map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Sport': 20,
 'Talk-Show': 21,
 'Thriller': 22,
 'War': 23,
 'Western': 24}

4. Replace the string genres in title_genres with the new integer ids

In [10]:
## make new integer genre_id and drop string genres
df['genre_id'] = df['genres_split'].replace(map)
df = df.drop(columns='genres_split')
df.head(2)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genre_id
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama,[Drama]

5. Convert the genre map dictionary into a dataframe.

In [11]:
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [12]:
title_genres = pd.DataFrame({'Genre_Name': map.keys(),
                             'Genre_ID': map.values()})

In [13]:
title_genres.head()

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

II) Creating MySQL tables with a primary key using Python
-

In [15]:
df.dtypes

tconst             object
titleType          object
primaryTitle       object
originalTitle      object
isAdult             int64
startYear         float64
endYear           float64
runtimeMinutes      int64
genres             object
genre_id           object
dtype: object

In [16]:
title_genres.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25 entries, 0 to 24
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Genre_Name  25 non-null     object
 1   Genre_ID    25 non-null     int64
dtypes: int64(1), object(1)
memory usage: 528.0+ bytes

In [17]:
# Create the sqlalchemy engine and connection
username = "root"
password = "root" 
db_name = "movies_db"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"
engine = create_engine(connection)
conn = engine.connect()

In [18]:
# Preview the names of all tables 
q = '''SHOW TABLES;'''
pd.read_sql(q, conn)

  Tables_in_movies_db
0              genres
1             ratings
2        title_basics
3        title_genres

In [19]:
q= '''SELECT * FROM title_genres'''
pd.read_sql(q, conn)

Empty DataFrame
Columns: [tconst, genre_id]
Index: []

In [22]:
q= '''DESCRIBE title_genres'''
describe = pd.read_sql(q, conn)
describe

      Field Type Null  Key Default           Extra
0    tconst  int   NO  PRI    None  auto_increment
1  genre_id  int  YES         None

In [23]:
# Checking describe's Field names
describe['Field'].values

array(['tconst', 'genre_id'], dtype=object)

In [24]:
title_genres.columns

Index(['Genre_Name', 'Genre_ID'], dtype='object')

In [25]:
# Rename columns to match SQL table
rename_map = {"Genre_Name":"tconst",
             "Genre_ID":"genre_id"}
title_genres = title_genres.rename(rename_map,axis=1)
title_genres.head(2)

   tconst  genre_id
0  Action         0
1   Adult         1

In [26]:
# Reviewing SQL table's data types
describe[['Field','Type']]

      Field Type
0    tconst  int
1  genre_id  int

In [27]:
title_genres.dtypes

tconst      object
genre_id     int64
dtype: object

In [37]:
title_genres['tconst'] = title_genres['tconst'].str.replace('tt', '')

In [38]:
title_genres['tconst'] = title_genres['tconst'].astype(int)

ValueError: invalid literal for int() with base 10: 'Action'

1. Creating a data type schema for to_sql:

2. Run df.to_sql with the dtype argument.

3. Run the query to ADD PRIMARY KEY